; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   green_ball_1 green_ball_2 - ball
   empty - empty_0
   room_1 room_4 - room
   red_door_1 green_door_1 grey_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (seen_psi_1) (hold_2) (hold_3) (hold_4) (hold_5))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (or (not (emptyhands)) (= ?obj green_ball_2)) (seen_psi_1)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (not (emptyhands)) (seen_psi_1)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (not (emptyhands)) (seen_psi_1)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (not (emptyhands)) (seen_psi_1)) (when (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))) (hold_2)) (when (and (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))) (emptyhands)) (not (hold_3))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (seen_psi_1) (hold_3) (when (and (objectinroom green_ball_1 room_4) (not (and (= ?obj green_ball_1) (= ?room room_4)))) (hold_4)) (hold_5) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (or (= ?obj green_ball_2) (at_ green_ball_2)) (seen_psi_1)) (when (agentinroom room_1) (not (hold_3))) (when (not (locked red_door_1)) (hold_5)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1)))) (seen_psi_1)) (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1))))))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1)))))) (hold_0)) (when (or (not (emptyhands)) (not (or (and (not (locked ?door)) (= ?door red_door_1)) (and (locked red_door_1) (not (and (locked ?door) (= ?door red_door_1))))))) (hold_5)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_2 room_3 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 - door
   blue_ball_2 blue_ball_1 blue_ball_3 yellow_ball_1 - ball
   red_box_1 blue_box_1 - box
 )
 (:init (agentinroom room_1) (objectinroom blue_ball_1 room_1) (objectinroom red_box_1 room_2) (objectinroom green_ball_1 room_2) (objectinroom yellow_ball_1 room_3) (objectinroom blue_ball_2 room_3) (objectinroom green_ball_2 room_3) (objectinroom blue_ball_3 room_3) (objectinroom blue_box_1 room_4) (objectcolor blue_ball_1 bluetype) (objectcolor red_box_1 redtype) (objectcolor green_ball_1 greentype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_ball_2 bluetype) (objectcolor green_ball_2 greentype) (objectcolor blue_ball_3 bluetype) (objectcolor blue_box_1 bluetype) (objectcolor red_door_1 redtype) (objectcolor green_door_1 greentype) (objectcolor purple_door_1 purpletype) (objectcolor grey_door_1 greytype) (emptyhands) (locked red_door_1) (locked green_door_1) (locked purple_door_1) (locked grey_door_1) (adjacentrooms room_2 room_1 red_door_1) (adjacentrooms room_1 room_2 red_door_1) (adjacentrooms room_3 room_1 green_door_1) (adjacentrooms room_1 room_3 green_door_1) (adjacentrooms room_4 room_2 purple_door_1) (adjacentrooms room_2 room_4 purple_door_1) (adjacentrooms room_4 room_3 grey_door_1) (adjacentrooms room_3 room_4 grey_door_1) (visited room_1) (hold_2) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d greytype) (adjacentrooms room_4 room_3 ?d) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_2) (hold_3) (hold_4) (hold_5)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor red_door_1 room_1 room_2)
   added: (at_ red_door_1)
   goals met: 1 of 6
2. (toggle red_door_1)
   deleted: (locked red_door_1)
   added: (hold_5)
   goals met: 2 of 6
3. (gotoroom room_1 room_2 red_door_1)
   deleted: (agentinroom room_1) (at_ red_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 2 of 6
4. (gotodoor purple_door_1 room_2 room_4)
   added: (at_ purple_door_1)
   goals met: 2 of 6
5. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 2 of 6
6. (gotoobject green_ball_1 room_2)
   deleted: (at_ purple_door_1)
   added: (at_ green_ball_1)
   goals met: 2 of 6
7. (pick green_ball_1 room_2)
   deleted: (at_ green_ball_1) (emptyhands) (objectinroom green_ball_1 room_2)
   added: (carrying green_ball_1) (seen_psi_1) (hold_3)
   goals met: 3 of 6
8. (gotoroom room_2 room_4 purple_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_4) (visited room_4)
   goals met: 3 of 6
9. (gotoempty)
   added: (at_ empty)
   goals met: 3 of 6
10. (drop green_ball_1 room_4)
   deleted: (carrying green_ball_1) (at_ empty)
   added: (at_ green_ball_1) (emptyhands) (objectinroom green_ball_1 room_4)
   goals met: 3 of 6
11. (gotoobject blue_box_1 room_4)
   deleted: (at_ green_ball_1)
   added: (at_ blue_box_1)
   goals met: 3 of 6
12. (pick blue_box_1 room_4)
   deleted: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_4)
   added: (carrying blue_box_1) (hold_4)
   goals met: 4 of 6
13. (gotodoor grey_door_1 room_4 room_3)
   added: (at_ grey_door_1)
   goals met: 4 of 6
14. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   added: (hold_0)
   goals met: 6 of 6
